library("C50")
data <- matrix(c(100.25600, 100.25600, 160.51200, 100.25600, 200.25600, 100.25600, 200.25600, 200.25600, 100.51200, 100.25600, 200.25600, 100.25600,
                 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0,
                 24.3, 16.3, 10.2, 24.3, 16.0, 24.3, 16.0, 16.0, 24.2, 16.84, 16.0, 24.3,
                 2499, 1739, 10199, 1599, 2499, 4999, 3849, 2449, 4399, 1699, 2499, 3495), 12, 4)
labels <- c("1", "2", "3", "4","5")
result <- c(1, 4, 5, 4, 3, 4, 1, 2, 3, 2, 3, 2)
test <- factor(result, labels)
colnames(data) <- c("ZakresCzu³oœci", "Obiektyw", "Rozdzielczoœæ", "Cena")
treeModel <- C5.0(x = data[,], y = test)
treeModel
summary(treeModel)
plot(treeModel)